CSI API ETABS v1
cDesignConcrete.GetRebarPrefsBeam Method
 Retrieves data from the Rebar Selection Rules for Beams
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarPrefsBeam(
	int Item,
	ref string Value
)
Function GetRebarPrefsBeam (
	Item As Integer,
	ByRef Value As String
) As Integer
Dim instance As cDesignConcrete
Dim Item As Integer
Dim Value As String
Dim returnValue As Integer
returnValue = instance.GetRebarPrefsBeam(Item,
	Value)
int GetRebarPrefsBeam(
	int Item,
	String^% Value
)
abstract GetRebarPrefsBeam :
        Item : int *
        Value : string byref -> int
Parameters
Item
Type: System.Int32
 An integer value corresponding to the data to be retrieved, from the following list
Non-Seismic Smallest Longitudinal Bar Size Top
Non-Seismic Largest Longitudinal Bar Size Top
Non-Seismic Preferred Longitudinal Bar Size Top
Non-Seismic Min Number of Bars Top
Non-Seismic Smallest Longitudinal Bar Size Bottom
Non-Seismic Largest Longitudinal Bar Size Bottom
Non-Seismic Preferred Longitudinal Bar Size Bottom
Non-Seismic Min Number of Bars Bottom
Non-Seismic Smallest Stirrup Bar Size
Non-Seismic Largest Stirrup Bar Size
Non-Seismic Stirrup Min Spacing
Non-Seismic Stirrup Max Spacing
Seismic Smallest Longitudinal Bar Size Top
Seismic Largest Longitudinal Bar Size Top
Seismic Preferred Longitudinal Bar Size Top
Seismic Min Number of Bars Top
Seismic Smallest Longitudinal Bar Size Bottom
Seismic Largest Longitudinal Bar Size Bottom
Seismic Preferred Longitudinal Bar Size Bottom
Seismic Min Number of Bars Bottom
Seismic Smallest Stirrup Bar Size
Seismic Largest Stirrup Bar Size
Seismic Stirrup Min Spacing
Seismic Stirrup Max Spacing
Value
Type: System.String
 The retrieved data; note that numerical values are converted to String
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise returns non-zero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value as String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'retrieve rebar data
       ret = SapModel.File.GetRebarPrefsBeam(2, Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace